from dataclasses import dataclass


@dataclass
class DayBreakoutParams:
    """
    n1 - используется для определения дней ускорения. При n1 = 3 день будет определен,
    как день с верхним ускорением, если его истинный максимум выше,
    чем наибольший истинный максимум трех предыдущих дней, и его истинный минимум ниже,
    чем наименьший истинный минимум следующих трех дней;
    n2 - количество предшествующих дней с нижним ускорением, используемое для
    вычисления наибольшего истинного максимума, который должен быть превышен при закрытии,
    чтобы возник сигнал к покупке. (Кроме того, это количество предыдущих дней с верхним
    ускорением, используемое для вычисления наименьшего истинного минимума, который должен
    быть пробит ценой закрытия для формирования сигнала к продаже).
    """

    n1: int
    n2: int
